cmsis-packs/cmsis-dfp-ht32/SVD/HT32F5828.svd
        <!--ISER2-->
        <register>
          <name>ISER2</name>
          <displayName>ISER2</displayName>
          <description>ISER2</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SETENA64</name>
              <description>SETENA64</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA65</name>
              <description>SETENA65</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA66</name>
              <description>SETENA66</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA67</name>
              <description>SETENA67</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA68</name>
              <description>SETENA68</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ICER0-->
        <register>
          <name>ICER0</name>
          <displayName>ICER0</displayName>
          <description>ICER0</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CLRENA0</name>
              <description>CLRENA0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA1</name>
              <description>CLRENA1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA2</name>
              <description>CLRENA2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA3</name>
              <description>CLRENA3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA4</name>
              <description>CLRENA4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA5</name>
              <description>CLRENA5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA6</name>
              <description>CLRENA6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA7</name>
              <description>CLRENA7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA8</name>
              <description>CLRENA8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA9</name>
              <description>CLRENA9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA10</name>
              <description>CLRENA10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA11</name>
              <description>CLRENA11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA12</name>
              <description>CLRENA12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA13</name>
              <description>CLRENA13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA14</name>
              <description>CLRENA14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA15</name>
              <description>CLRENA15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA16</name>
              <description>CLRENA16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA17</name>
              <description>CLRENA17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA18</name>
              <description>CLRENA18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA19</name>
              <description>CLRENA19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA20</name>
              <description>CLRENA20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA21</name>
              <description>CLRENA21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA22</name>
              <description>CLRENA22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA23</name>
              <description>CLRENA23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA24</name>
              <description>CLRENA24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA25</name>
              <description>CLRENA25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA26</name>
              <description>CLRENA26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA27</name>
              <description>CLRENA27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA28</name>
              <description>CLRENA28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA29</name>
              <description>CLRENA29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA30</name>
              <description>CLRENA30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CLRENA31</name>
              <description>CLRENA31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
